app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
  <tbody>
  <%if @post.comments.present?%>
  <div class = "row justify-content-start"><strong>Comments :</strong></div>
    <% @post.comments.each do |comment| %>