app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.user = @current_user
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "post first post update"], ["updated_at", "2020-03-14 18:30:03.680480"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 8]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 6]]
---
  def destroy
    @post.comments.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])