app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.avatar.attach(params[:avatar])
    respond_to do |format|
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "first user"], ["email", "firstuser@gmail.com"], ["created_at", "2020-03-14 10:09:35.945325"], ["updated_at", "2020-03-14 10:09:35.945325"]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "first user"], ["email", "firstuser@gmail.com"], ["created_at", "2020-03-14 09:54:29.001392"], ["updated_at", "2020-03-14 09:54:29.001392"]]

  def update
    respond_to do |format|
      @user.avatar.purge if params[:avatar].present?
      @user.avatar.attach(params[:avatar])
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2020-03-14 16:42:08.901538"], ["id", 3]]

  def login
    user = User.authenticate(params[:email],params[:password])
      if user.present?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "vinu@gmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "vinu@gmail.com"], ["id", 3], ["LIMIT", 1]]